//p05_12.cpp - многомерные массивы - доступ по указателям
	#include <iostream>

	using namespace std;

	int main() {
		int b[3][2][4] = {  
			0,   1,   2,   3,
			10,  11,  12,  13,
			100, 101, 102, 103,
			110, 111, 112, 113,
			200, 201, 202, 203,
			210, 211, 212, 213
			};

		// Адрес массива b[][][]
		cout << "\nАдрес массива b[][][] " << " b = " << b;

		// Адрес массива b[0][][]
		cout << "\nАдрес массива b[0][][]  *b = " << *b;

		// Адрес массива b[0][0][]
		cout << "\nАдрес массива b[0][0][]  **b = " << **b;

		// Элемент массива b[0][0][0]
		cout << "\nЭлемент массива b[0][0][0]  ***b = " << ***b;

		// Адрес массива b[1][][]
		cout << "\nАдрес массива b[1][][]  *(b + 1) = " << *(b + 1);

		// Адрес массива b[2][][]
		cout << "\nАдрес массива b[2][][]  *(b + 2) = " << *(b + 2);

		// Адрес массива b[0][1][]
		cout << "\nАдрес массива b[0][1][]  *(*b + 1) = " << *(*b + 1);
		cout << "\nАдрес массива b[0][1][]  *(*(*(b + 1) + 1) + 1) = " << *(*(*(b + 1) + 1) + 1);
		cout << "\nАдрес массива b[0][1][]  *(b[1][1] + 1) = " << *(b[1][1] + 1);

		// Элемент b[2][0][0]
		cout << "\nЭлемент массива b[2][0][0]  *(b[1] + 1)[1] = " << *(b[1] + 1)[1];

		cout << endl;
		return 0;
	}
